In [ ]:
import pandas as pd

# Simple list example (unused but kept for demonstration)
fruits = ['apple', 'banana', 'cherry']
fruits_df = pd.DataFrame(fruits, columns=['Fruit'])  # Optional: print(fruits_df)

# Dictionary to build a DataFrame
people = {
    "Name": ["Alice", "Bob", "Charlie"],
    "Age": [25, 30, 35],
    "City": ["New York", "Los Angeles", "Chicago"]
}

# Build full DataFrame including City so we can access it
people_df = pd.DataFrame(people)
print("First city:", people_df["City"][1])

First city: Los Angeles

In [2]:
import pandas as pd
sr={"r":pd.Series([2,4,6,8]), "s":pd.Series([6,20,18,56])}

var=pd.DataFrame(sr)
# var["div"]=var["s"]/var["r"]
# var["mul"]=var["s"]*var["r"]
# var["add"]=var["s"]+var["r"]
# var["sub"]=var["s"]-var["r"]
# var["comp"]=var["mul"]<100
var.insert(2, "div", [1,2,3,4])
var["partial"]=var["r"][:2]
# var.pop("div")
# del var["partial"]
var
# var.to_csv("data.csv")
var.to_csv("data1.csv",index=False)

In [ ]:
import pandas as pd
csv1=pd.read_csv("C:\\Users\\NILOY\\Downloads\\customers.csv",nrows=2,usecols=[1,4])
csv1

        Customer Id                          Company
0   DD37Cf93aecA6Dc                  Rasmussen Group
1   1Ef7b82A4CAAD10                      Vega-Gentry
2   6F94879bDAfE5a6                    Murillo-Perry
3   5Cef8BFA16c5e3c  Dominguez, Mcmillan and Donovan
4   053d585Ab6b3159         Martin, Lang and Andrade
..              ...                              ...
95  cb8E23e48d22Eae                        Carey LLC
96  CeD220bdAaCfaDf            Ware, Burns and Oneal
97  28CDbC0dFe4b1Db                    Schmitt-Jones
98  c23d1D9EE8DEB0A               Fitzgerald-Harrell
99  2354a0E336A91A1               Le, Nash and Cross

[100 rows x 2 columns]

In [35]:
import pandas as pd
csv1=pd.read_csv("corrupted_data.csv")
csv1

,id,name,age,salary,department,join_date,email,performance_score
0,1,John Doe,28.0,50000,IT,2020-01-15,john.doe@company.com,85.0
1,2,Jane Smith,32.0,60000,HR,2019-03-22,jane.smith@company.com,92.0
2,3,Bob Johnson,45.0,75000,Finance,2015-11-30,bob.johnson@company.com,78.0
3,4,Alice Brown,29.0,55000,IT,2021-06-14,alice.brown@company.com,88.0
4,5,Charlie Wilson,-35.0,abcde,Marketing,2022-02-28,charlie.wilson@company.com,91.0
5,6,NaN,41.0,70000,Sales,2018-09-10,NaN,76.0
6,7,"Davis, Mike",38.0,65000,IT,2020-12-05,mike.davis@company.com,94.0
7,8,Sarah Lee,27.0,52000,HR,2023-01-18,sarah.lee@company.com,NaN
8,9,Tom Harris,52.0,80000,Finance,2012-07-22,tom.harris@company.com,87.0
9,10,Lisa Chen,31.0,58000,Marketing,invalid_date,lisa.chen@company.com,83.0
10,11,James Miller,36.0,72000,Sales,2019-04-15,james.miller@company.com,95.0
11,12,Karen White,29.0,56000,IT,2021-08-30,karen.white@company.com,79.0
12,13,Robert Taylor,47.0,NaN,Finance,2016-05-12,robert.taylor@company.com,84.0
13,14,Emily Davis,26.0,51000,HR,2023-03-08,emily.davis@company.com,90.0
14,15,Kevin Adams,33.0,63000,Marketing,2020-11-19,kevin.adamscompany.com,82.0
15,16,Maria Garcia,44.0,77000,Sales,2017-12-03,maria.garcia@company.com,89.0
16,17,NaN,NaN,NaN,NaN,NaN,NaN,NaN
17,18,Jennifer King,28.0,54000,HR,2022-07-14,jennifer.king@company.com,86.0
18,19,Paul Scott,51.0,79000,Finance,2014-02-28,paul.scott@company.com,80.0
19,20,Amanda Young,30.0,59000,Marketing,2021-09-12,amanda.young@company.com,97.0

In [ ]:
import pandas as pd
csv1=pd.read_csv("corrupted_data.csv")
csv1.dropna(subset=["email"])

In [45]:
import pandas as pd
csv1=pd.read_csv("corrupted_data.csv")
csv1.fillna({"name":"no name","email":"no email","department":"no department"})

,id,name,age,salary,department,join_date,email,performance_score
0,1,John Doe,28.0,50000,IT,2020-01-15,john.doe@company.com,85.0
1,2,Jane Smith,32.0,60000,HR,2019-03-22,jane.smith@company.com,92.0
2,3,Bob Johnson,45.0,75000,Finance,2015-11-30,bob.johnson@company.com,78.0
3,4,Alice Brown,29.0,55000,IT,2021-06-14,alice.brown@company.com,88.0
4,5,Charlie Wilson,-35.0,abcde,Marketing,2022-02-28,charlie.wilson@company.com,91.0
5,6,no name,41.0,70000,Sales,2018-09-10,no email,76.0
6,7,"Davis, Mike",38.0,65000,IT,2020-12-05,mike.davis@company.com,94.0
7,8,Sarah Lee,27.0,52000,HR,2023-01-18,sarah.lee@company.com,NaN
8,9,Tom Harris,52.0,80000,Finance,2012-07-22,tom.harris@company.com,87.0
9,10,Lisa Chen,31.0,58000,Marketing,invalid_date,lisa.chen@company.com,83.0
10,11,James Miller,36.0,72000,Sales,2019-04-15,james.miller@company.com,95.0
11,12,Karen White,29.0,56000,IT,2021-08-30,karen.white@company.com,79.0
12,13,Robert Taylor,47.0,NaN,Finance,2016-05-12,robert.taylor@company.com,84.0
13,14,Emily Davis,26.0,51000,HR,2023-03-08,emily.davis@company.com,90.0
14,15,Kevin Adams,33.0,63000,Marketing,2020-11-19,kevin.adamscompany.com,82.0
15,16,Maria Garcia,44.0,77000,Sales,2017-12-03,maria.garcia@company.com,89.0
16,17,no name,NaN,NaN,no department,NaN,no email,NaN
17,18,Jennifer King,28.0,54000,HR,2022-07-14,jennifer.king@company.com,86.0
18,19,Paul Scott,51.0,79000,Finance,2014-02-28,paul.scott@company.com,80.0
19,20,Amanda Young,30.0,59000,Marketing,2021-09-12,amanda.young@company.com,97.0

In [54]:
import pandas as pd 
var1=pd.DataFrame({"A":[1,2,3,4],"B":[14,15,16,20]})

var2=pd.DataFrame({"A":[1,2,3,5],"C":[21,22,23,24]})
# pd.merge(var1,var2,on="A",how="outer",indicator="true")  # other options: outer, left, right
pd.concat([var1,var2],ignore_index=True)  # axis=1 for column wise

   A     B     C
0  1  14.0   NaN
1  2  15.0   NaN
2  3  16.0   NaN
3  4  20.0   NaN
4  1   NaN  21.0
5  2   NaN  22.0
6  3   NaN  23.0
7  5   NaN  24.0

In [17]:
import pandas as pd
var=pd.DataFrame({"A":["a","b","c","b","c","d","a","c","a","d"],"B":[11,12,13,14,15,12,13,12,14,12],"C":[21,22,23,24,25,26,27,28,29,30]})
var.groupby("A")

var_new=var.groupby("B")


for x,y in var_new:
    print(x)
    print(y)

11
   A   B   C
0  a  11  21
12
   A   B   C
1  b  12  22
5  d  12  26
7  c  12  28
9  d  12  30
13
   A   B   C
2  c  13  23
6  a  13  27
14
   A   B   C
3  b  14  24
8  a  14  29
15
   A   B   C
4  c  15  25

In [18]:
# var_new.sum()
# var_new.max()
var_new.describe()

       C
   count  mean       std   min    25%   50%    75%   max
B
11   1.0  21.0       NaN  21.0  21.00  21.0  21.00  21.0
12   4.0  26.5  3.415650  22.0  25.00  27.0  28.50  30.0
13   2.0  25.0  2.828427  23.0  24.00  25.0  26.00  27.0
14   2.0  26.5  3.535534  24.0  25.25  26.5  27.75  29.0
15   1.0  25.0       NaN  25.0  25.00  25.0  25.00  25.0